zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10032.atdf
        <register name="CTRLD" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Control D">
          <bitfield name="SAMPNUM" caption="Sample Accumulation Number Select" mask="0xF" values="ADC_CTRLD__SAMPNUM"/>
          <bitfield name="RESOLUTION" caption="ADC Resolution" mask="0x300" values="ADC_CTRLD__RESOLUTION"/>
          <bitfield name="SCALING" caption="Result Scaling" mask="0xC00" values="ADC_CTRLD__SCALING"/>
          <bitfield name="FREERUN" caption="Free-Running" mask="0x1000"/>
          <bitfield name="CHOPPING" caption="Sign Chopping" mask="0x2000"/>
          <bitfield name="FILTER" caption="Low-Pass Filter" mask="0x4000"/>
          <bitfield name="VPD" caption="Voltage Pump Disable" mask="0x10000"/>
        </register>
        <register name="CTRLE" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Control E">
          <bitfield name="SAMPLEN" caption="Sample Length" mask="0xFF"/>
        </register>
        <register name="WINCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Window Control">
          <bitfield name="WINMODE" caption="Window Comparator Mode" mask="0x7" values="ADC_WINCTRL__WINMODE"/>
          <bitfield name="WINSRC" caption="Window Mode Source" mask="0x8" values="ADC_WINCTRL__WINSRC"/>
        </register>
        <register name="WINLT" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Window Low Threshold">
          <bitfield name="WINLT" caption="Window Low Threshold" mask="0xFFFF"/>
        </register>
        <register name="WINHT" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Window High Threshold">
          <bitfield name="WINHT" caption="Window High Threshold" mask="0xFFFF"/>
        </register>
        <register name="INPUTCTRL" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Input Multiplexer Control">
          <bitfield name="MUXNEG" caption="Negative Input Multiplexer" mask="0x7F" values="ADC_INPUTCTRL__MUXNEG"/>
          <bitfield name="MUXPOS" caption="Positive Input Multiplexer" mask="0x7F00" values="ADC_INPUTCTRL__MUXPOS"/>
        </register>
        <register name="EVCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="STARTEI" caption="Conversion Start Event Input Enable" mask="0x1"/>
          <bitfield name="STARTINV" caption="Conversion Start Event Input Invert" mask="0x10"/>
          <bitfield name="RESRDYEO" caption="Result Ready Event Output Enable" mask="0x100"/>
          <bitfield name="SAMPRDYEO" caption="Sample Ready Event Output Enable" mask="0x200"/>
          <bitfield name="WCMPEO" caption="Window Comparator Event Output Enable" mask="0x400"/>
        </register>
        <register name="INTENCLR" offset="0x30" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="SAMPRDY" caption="Sample Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="WCMP" caption="Window Comparator Interrupt Enable" mask="0x4"/>
          <bitfield name="RESOVR" caption="Result Overwrite Interrupt Enable" mask="0x8"/>
          <bitfield name="SAMPOVR" caption="Sample Overwrite Interrupt Enable" mask="0x10"/>
          <bitfield name="TRIGOVR" caption="Trigger Overrun Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTENSET" offset="0x34" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="SAMPRDY" caption="Sample Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="WCMP" caption="Window Comparator Interrupt Enable" mask="0x4"/>
          <bitfield name="RESOVR" caption="Result Overwrite Interrupt Enable" mask="0x8"/>
          <bitfield name="SAMPOVR" caption="Sample Overwrite Interrupt Enable" mask="0x10"/>
          <bitfield name="TRIGOVR" caption="Trigger Overrun Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0x38" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Flag" mask="0x1"/>
          <bitfield name="SAMPRDY" caption="Sample Ready Interrupt Flag" mask="0x2"/>
          <bitfield name="WCMP" caption="Window Comparator Interrupt Flag" mask="0x4"/>
          <bitfield name="RESOVR" caption="Result Overwrite Interrupt Flag" mask="0x8"/>
          <bitfield name="SAMPOVR" caption="Sample Overwrite Interrupt Flag" mask="0x10"/>
          <bitfield name="TRIGOVR" caption="Trigger Overrun Interrupt Flag" mask="0x20"/>
        </register>
        <register name="INTFLAGSET" offset="0x3C" rw="RW" size="4" atomic-op="clear:INTFLAGSET" initval="0x00000000" caption="Interrupt Flag Set">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Flag" mask="0x1"/>
          <bitfield name="SAMPRDY" caption="Sample Ready Interrupt Flag" mask="0x2"/>
          <bitfield name="WCMP" caption="Window Comparator Interrupt Flag" mask="0x4"/>
          <bitfield name="RESOVR" caption="Result Overwrite Interrupt Flag" mask="0x8"/>
          <bitfield name="SAMPOVR" caption="Sample Overwrite Interrupt Flag" mask="0x10"/>
          <bitfield name="TRIGOVR" caption="Trigger Overrun Interrupt Flag" mask="0x20"/>
        </register>
        <register name="STATUS" offset="0x40" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="ADCBUSY" caption="ADC Busy" mask="0x1"/>
        </register>
        <register name="COMMAND" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="Command">
          <bitfield name="START" caption="Start Conversion" mask="0x7" values="ADC_COMMAND__START"/>
          <bitfield name="MODE" caption="Mode" mask="0x70" values="ADC_COMMAND__MODE"/>
          <bitfield name="DIFF" caption="Differential Mode" mask="0x80"/>
        </register>
