zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10032.atdf
        <register name="RESULT" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="Result">
          <bitfield name="RESULT" caption="ADC Result" mask="0xFFFFFFFF"/>
        </register>
        <register name="SAMPLE" offset="0x54" rw="RW" size="4" initval="0x00000000" caption="Sample">
          <bitfield name="SAMPLE" caption="ADC Sample" mask="0xFFFF"/>
        </register>
        <register name="DBGCTRL" offset="0x6C" rw="RW" size="4" initval="0x00000000" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="WPCTRL" offset="0x7C" rw="RW" size="4" initval="0x00000000" caption="Write Protection Control">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPLCK" caption="Write Protection Lock" mask="0x2"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="ADC_WPCTRL__WPKEY"/>
        </register>
      </register-group>
      <value-group name="ADC_CTRLB__PRESCALER">
        <value name="DIV2" caption="APB clock divided by 2" value="0x00"/>
        <value name="DIV3" caption="APB clock divided by 3" value="0x01"/>
        <value name="DIV4" caption="APB clock divided by 4" value="0x02"/>
        <value name="DIV5" caption="APB clock divided by 5" value="0x03"/>
        <value name="DIV6" caption="APB clock divided by 6" value="0x04"/>
        <value name="DIV7" caption="APB clock divided by 7" value="0x05"/>
        <value name="DIV8" caption="APB clock divided by 8" value="0x06"/>
        <value name="DIV9" caption="APB clock divided by 9" value="0x07"/>
        <value name="DIV10" caption="APB clock divided by 10" value="0x08"/>
        <value name="DIV11" caption="APB clock divided by 11" value="0x09"/>
        <value name="DIV12" caption="APB clock divided by 12" value="0x0A"/>
        <value name="DIV13" caption="APB clock divided by 13" value="0x0B"/>
        <value name="DIV14" caption="APB clock divided by 14" value="0x0C"/>
        <value name="DIV15" caption="APB clock divided by 15" value="0x0D"/>
        <value name="DIV16" caption="APB clock divided by 16" value="0x0E"/>
        <value name="DIV17" caption="APB clock divided by 17" value="0x0F"/>
        <value name="DIV18" caption="APB clock divided by 18" value="0x10"/>
        <value name="DIV19" caption="APB clock divided by 19" value="0x11"/>
        <value name="DIV20" caption="APB clock divided by 20" value="0x12"/>
        <value name="DIV21" caption="APB clock divided by 21" value="0x13"/>
        <value name="DIV22" caption="APB clock divided by 22" value="0x14"/>
        <value name="DIV23" caption="APB clock divided by 23" value="0x15"/>
        <value name="DIV24" caption="APB clock divided by 24" value="0x16"/>
        <value name="DIV25" caption="APB clock divided by 25" value="0x17"/>
        <value name="DIV26" caption="APB clock divided by 26" value="0x18"/>
        <value name="DIV27" caption="APB clock divided by 27" value="0x19"/>
        <value name="DIV28" caption="APB clock divided by 28" value="0x1A"/>
        <value name="DIV29" caption="APB clock divided by 29" value="0x1B"/>
        <value name="DIV30" caption="APB clock divided by 30" value="0x1C"/>
        <value name="DIV31" caption="APB clock divided by 31" value="0x1D"/>
        <value name="DIV32" caption="APB clock divided by 32" value="0x1E"/>
      </value-group>
      <value-group name="ADC_CTRLC__REFSEL">
        <value name="VDD" caption="VDD" value="0x0"/>
        <value name="EXTVREF" caption="External pin used as reference" value="0x2"/>
        <value name="1V024" caption="Internal reference 1.024V" value="0x4"/>
        <value name="2V048" caption="Internal reference 2.048V" value="0x5"/>
        <value name="4V096" caption="Internal reference 4.096V" value="0x6"/>
        <value name="2V500" caption="Internal reference 2.500V" value="0x7"/>
      </value-group>
      <value-group name="ADC_CTRLD__SAMPNUM">
        <value name="NONE" caption="No accumulation, single sample per conversion result" value="0x0"/>
        <value name="ACC2" caption="2 samples accumulated" value="0x1"/>
        <value name="ACC4" caption="4 samples accumulated" value="0x2"/>
        <value name="ACC8" caption="8 samples accumulated" value="0x3"/>
        <value name="ACC16" caption="16 samples accumulated" value="0x4"/>
        <value name="ACC32" caption="32 samples accumulated" value="0x5"/>
        <value name="ACC64" caption="64 samples accumulated" value="0x6"/>
        <value name="ACC128" caption="128 samples accumulated" value="0x7"/>
        <value name="ACC256" caption="256 samples accumulated" value="0x8"/>
        <value name="ACC512" caption="512 samples accumulated" value="0x9"/>
        <value name="ACC1024" caption="1024 samples accumulated" value="0xA"/>
      </value-group>
      <value-group name="ADC_CTRLD__RESOLUTION">
        <value name="12BIT" caption="12-bit ADC Result" value="0x0"/>
        <value name="13BIT" caption="13-bit ADC Result" value="0x1"/>
        <value name="10BIT" caption="10-bit ADC Result" value="0x2"/>
        <value name="8BIT" caption="8-bit ADC Result" value="0x3"/>
      </value-group>
      <value-group name="ADC_CTRLD__SCALING">
        <value name="NORMAL" caption="The ADC output of the sample or accumulated result is right adjusted" value="0x0"/>
        <value name="LEFTADJ" caption="The ADC output is left adjusted" value="0x1"/>
        <value name="AVERAGE" caption="The accumulated ADC result is averaged and right adjusted" value="0x2"/>
      </value-group>
      <value-group name="ADC_WINCTRL__WINMODE">
        <value name="NONE" caption="No Window Comparison" value="0x0"/>
        <value name="BELOW" caption="OUTPUT 'less than' WINLT" value="0x1"/>
        <value name="ABOVE" caption="OUTPUT 'greater than' WINHT" value="0x2"/>
        <value name="INSIDE" caption="WINLT 'less than' OUTPUT 'less than' WINHT" value="0x3"/>
        <value name="OUTSIDE" caption="OUTPUT 'less than' WINLT or OUTPUT 'greater than'WINHT" value="0x4"/>
      </value-group>
      <value-group name="ADC_WINCTRL__WINSRC">
        <value name="RESULT" caption="Use RESULT[15:0] as Window Comparator source" value="0x0"/>
        <value name="SAMPLE" caption="Use SAMPLE[15:0] as Window Comparator source" value="0x1"/>
      </value-group>
