zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10032.atdf
      <value-group name="EIC_NMICTRL__NMISENSE">
        <value name="NONE" caption="No detection" value="0x0"/>
        <value name="RISE" caption="Rising-edge detection" value="0x1"/>
        <value name="FALL" caption="Falling-edge detection" value="0x2"/>
        <value name="BOTH" caption="Both-edge detection" value="0x3"/>
        <value name="HIGH" caption="High-level detection" value="0x4"/>
        <value name="LOW" caption="Low-level detection" value="0x5"/>
      </value-group>
      <value-group name="EIC_CONFIG0__SENSEx">
        <value name="NONE" caption="No detection" value="0x0"/>
        <value name="RISE" caption="Rising-edge detection" value="0x1"/>
        <value name="FALL" caption="Falling-edge detection" value="0x2"/>
        <value name="BOTH" caption="Both-edge detection" value="0x3"/>
        <value name="HIGH" caption="High-level detection" value="0x4"/>
        <value name="LOW" caption="Low-level detection" value="0x5"/>
      </value-group>
      <value-group name="EIC_CONFIG1__SENSEx">
        <value name="NONE" caption="No detection" value="0x0"/>
        <value name="RISE" caption="Rising-edge detection" value="0x1"/>
        <value name="FALL" caption="Falling-edge detection" value="0x2"/>
        <value name="BOTH" caption="Both-edge detection" value="0x3"/>
        <value name="HIGH" caption="High-level detection" value="0x4"/>
        <value name="LOW" caption="Low-level detection" value="0x5"/>
      </value-group>
    </module>
    <module name="EVSYS" id="U2256" name2="U2256" version="v1" caption="Event System">
      <register-group name="EVSYS" caption="Event System">
        <register name="CTRLA" offset="0x0" rw="W" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="CHSTATUS" offset="0xC" rw="R" size="4" caption="Channel Status">
          <bitfield name="USRRDY0" caption="Users Ready on Channel 0" mask="0x1"/>
          <bitfield name="USRRDY1" caption="Users Ready on Channel 1" mask="0x2"/>
          <bitfield name="USRRDY2" caption="Users Ready on Channel 2" mask="0x4"/>
          <bitfield name="USRRDY3" caption="Users Ready on Channel 3" mask="0x8"/>
          <bitfield name="CHBUSY0" caption="Channel 0 Busy" mask="0x10000"/>
          <bitfield name="CHBUSY1" caption="Channel 1 Busy" mask="0x20000"/>
          <bitfield name="CHBUSY2" caption="Channel 2 Busy" mask="0x40000"/>
          <bitfield name="CHBUSY3" caption="Channel 3 Busy" mask="0x80000"/>
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="OVR0" caption="Overrun Channel 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="OVR1" caption="Overrun Channel 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="OVR2" caption="Overrun Channel 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR3" caption="Overrun Channel 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="EVD0" caption="Event Detected Channel 0 Interrupt Enable" mask="0x10000"/>
          <bitfield name="EVD1" caption="Event Detected Channel 1 Interrupt Enable" mask="0x20000"/>
          <bitfield name="EVD2" caption="Event Detected Channel 2 Interrupt Enable" mask="0x40000"/>
          <bitfield name="EVD3" caption="Event Detected Channel 3 Interrupt Enable" mask="0x80000"/>
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="OVR0" caption="Overrun Channel 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="OVR1" caption="Overrun Channel 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="OVR2" caption="Overrun Channel 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR3" caption="Overrun Channel 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="EVD0" caption="Event Detected Channel 0 Interrupt Enable" mask="0x10000"/>
          <bitfield name="EVD1" caption="Event Detected Channel 1 Interrupt Enable" mask="0x20000"/>
          <bitfield name="EVD2" caption="Event Detected Channel 2 Interrupt Enable" mask="0x40000"/>
          <bitfield name="EVD3" caption="Event Detected Channel 3 Interrupt Enable" mask="0x80000"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVR0" caption="Overrun Channel 0" mask="0x1"/>
          <bitfield name="OVR1" caption="Overrun Channel 1" mask="0x2"/>
          <bitfield name="OVR2" caption="Overrun Channel 2" mask="0x4"/>
          <bitfield name="OVR3" caption="Overrun Channel 3" mask="0x8"/>
          <bitfield name="EVD0" caption="Event Detected Channel 0" mask="0x10000"/>
          <bitfield name="EVD1" caption="Event Detected Channel 1" mask="0x20000"/>
          <bitfield name="EVD2" caption="Event Detected Channel 2" mask="0x40000"/>
          <bitfield name="EVD3" caption="Event Detected Channel 3" mask="0x80000"/>
        </register>
        <register name="SWEVT" offset="0x1C" rw="W" size="4" initval="0x00000000" caption="Software Event">
          <bitfield name="CHANNEL0" caption="Channel 0 Software Selection" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Channel 1 Software Selection" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Channel 2 Software Selection" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Channel 3 Software Selection" mask="0x8"/>
        </register>
        <register name="CHANNEL" offset="0x20" rw="RW" size="4" count="4" initval="0x00008000" caption="Channel # Control">
          <bitfield name="EVGEN" caption="Event Generator" mask="0x7F"/>
          <bitfield name="PATH" caption="Path Selection" mask="0x300" values="EVSYS_CHANNEL__PATH"/>
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC00" values="EVSYS_CHANNEL__EDGSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x4000"/>
          <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000"/>
        </register>
