zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10032.atdf
        <register name="SFR" offset="0x110" rw="RW" size="4" access-size="4" count="16" initval="0x00000000" caption="Special Function">
          <bitfield name="SFR" caption="Special Function Register" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="HMATRIXB_MCFG__ULBT">
        <value name="INFINITE" caption="Infinite Length" value="0"/>
        <value name="SINGLE" caption="Single Access" value="1"/>
        <value name="FOUR_BEAT" caption="Four Beat Burst" value="2"/>
        <value name="EIGHT_BEAT" caption="Eight Beat Burst" value="3"/>
        <value name="SIXTEEN_BEAT" caption="Sixteen Beat Burst" value="4"/>
      </value-group>
      <value-group name="HMATRIXB_SCFG__DEFMSTR_TYPE">
        <value name="NO_DEFAULT" caption="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." value="0"/>
        <value name="LAST_DEFAULT" caption="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." value="1"/>
        <value name="FIXED_DEFAULT" caption="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." value="2"/>
      </value-group>
      <value-group name="HMATRIXB_SCFG__ARBT">
        <value name="ROUND_ROBIN" caption="Round-Robin Arbitration" value="0"/>
        <value name="FIXED_PRIORITY" caption="Fixed Priority Arbitration" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB0">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB1">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB2">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB3">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB4">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB5">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB6">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB7">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB8">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB9">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB10">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB11">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB12">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB13">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB14">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB15">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
    </module>
    <module name="MCLK" id="U2234" name2="U2234" version="v1" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="INTENCLR" offset="0x1" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x2" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x3" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x01" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Flag" mask="0x1"/>
        </register>
        <register name="CPUDIV" offset="0x4" rw="RW" size="1" initval="0x01" caption="CPU Clock Division">
          <bitfield name="CPUDIV" caption="CPU Clock Division Factor" mask="0xFF" values="MCLK_CPUDIV__CPUDIV"/>
        </register>
        <register name="AHBMASK" offset="0x10" rw="RW" size="4" initval="0x000003FF" caption="AHB Bridge Mask">
          <bitfield name="APBA_" caption="APBA AHB Clock Mask" mask="0x1"/>
          <bitfield name="APBB_" caption="APBB AHB Clock Mask" mask="0x2"/>
          <bitfield name="APBC_" caption="APBC AHB Clock Mask" mask="0x4"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x8"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS AHB Clock Mask" mask="0x10"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x20"/>
          <bitfield name="HSRAM_" caption="HSRAM AHB Clock Mask" mask="0x40"/>
          <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x80"/>
          <bitfield name="PAC_" caption="PAC AHB Clock Mask" mask="0x100"/>
          <bitfield name="BROM_" caption="BROM AHB Clock Mask" mask="0x200"/>
        </register>
        <register name="APBAMASK" offset="0x14" rw="RW" size="4" initval="0x000007FF" caption="APB Bridge A Mask">
          <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Clock Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x400"/>
        </register>
        <register name="APBBMASK" offset="0x18" rw="RW" size="4" initval="0x00000027" caption="APB Bridge B Mask">
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC APB Clock Enable" mask="0x8"/>
          <bitfield name="MTB_" caption="MTB APB Clock Enable" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Clock Enable" mask="0x20"/>
        </register>
        <register name="APBCMASK" offset="0x1C" rw="RW" size="4" initval="0x00000800" caption="APB Bridge C Mask">
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x4"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x8"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x10"/>
          <bitfield name="TC2_" caption="TC2 APB Clock Enable" mask="0x20"/>
          <bitfield name="TCC0_" caption="TCC0 APB Clock Enable" mask="0x40"/>
          <bitfield name="ADC0_" caption="ADC0 APB Clock Enable" mask="0x80"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x100"/>
          <bitfield name="CCL_" caption="CCL APB Clock Enable" mask="0x200"/>
          <bitfield name="PTC_" caption="PTC APB Clock Enable" mask="0x400"/>
          <bitfield name="SYSCTRL_" caption="SYSCTRL APB Clock Enable" mask="0x800"/>
        </register>
      </register-group>
      <value-group name="MCLK_CPUDIV__CPUDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="MTB" id="U2002" name2="U2002" version="1.a.0" caption="Cortex-M0+ Micro-Trace Buffer">
      <register-group name="MTB" caption="Cortex-M0+ Micro-Trace Buffer">
        <register name="POSITION" offset="0x0" rw="RW" size="4" caption="MTB Position">
          <bitfield name="WRAP" caption="Pointer Value Wraps" mask="0x4"/>
          <bitfield name="POINTER" caption="Trace Packet Location Pointer" mask="0xFFFFFFF8"/>
        </register>
        <register name="MASTER" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="MTB Master">
          <bitfield name="MASK" caption="Maximum Value of the Trace Buffer in SRAM" mask="0x1F"/>
          <bitfield name="TSTARTEN" caption="Trace Start Input Enable" mask="0x20"/>
          <bitfield name="TSTOPEN" caption="Trace Stop Input Enable" mask="0x40"/>
          <bitfield name="SFRWPRIV" caption="Special Function Register Write Privilege" mask="0x80"/>
          <bitfield name="RAMPRIV" caption="SRAM Privilege" mask="0x100"/>
          <bitfield name="HALTREQ" caption="Halt Request" mask="0x200"/>
          <bitfield name="EN" caption="Main Trace Enable" mask="0x80000000"/>
        </register>
