zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10032.atdf
      <value-group name="OSC32KCTRL_WPCTRL__WPKEY">
        <value name="KEY" caption="Allow writes to the WPCTRL register" value="0x4F5343"/>
      </value-group>
    </module>
    <module name="OSCCTRL" id="06250" name2="osc_ctrl_arm_v1" version="v1" caption="Oscillators Controller">
      <register-group name="OSCCTRL" caption="Oscillators Controller">
        <register name="INTENCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="OSCHFRDY" caption="OSCHF Ready Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTENSET" offset="0x8" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="OSCHFRDY" caption="OSCHF Ready Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="OSCHFRDY" caption="OSCHF is Ready" mask="0x10"/>
        </register>
        <register name="INTFLAGSET" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGSET" initval="0x00000000" caption="Interrupt Flag Software Set">
          <bitfield name="OSCHFRDY" caption="OSCHF is Ready" mask="0x10"/>
        </register>
        <register name="STATUS" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="OSCHFRDY" caption="OSCHF is Ready" mask="0x10"/>
        </register>
        <register name="OSCHFCTRL" offset="0x24" rw="RW" size="4" initval="0x00000C80" caption="OSCHF Control">
          <bitfield name="ONDEMAND" caption="On-Demand Operation" mask="0x80"/>
          <bitfield name="AUTOTUNE" caption="Automatic oscillator tune" mask="0x100" values="OSCCTRL_OSCHFCTRL__AUTOTUNE"/>
          <bitfield name="FRQSEL" caption="Frequency Select" mask="0x3C00" values="OSCCTRL_OSCHFCTRL__FRQSEL"/>
        </register>
        <register name="OSCHFTUNE" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="OSCHF Oscillator Frequency Tune">
          <bitfield name="TUNE" caption="Oscillator Tune" mask="0xFF"/>
        </register>
        <register name="WPCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Write Protection Control">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPLCK" caption="Write Protection Lock" mask="0x2"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="OSCCTRL_WPCTRL__WPKEY"/>
        </register>
      </register-group>
      <value-group name="OSCCTRL_OSCHFCTRL__AUTOTUNE">
        <value name="OFF" caption="Automatic oscillator frequency tune disabled" value="0x0"/>
        <value name="ON" caption="Automatic oscillator frequency tune enabled" value="0x1"/>
      </value-group>
      <value-group name="OSCCTRL_OSCHFCTRL__FRQSEL">
        <value name="1M" caption="1 MHz output clock" value="0x0"/>
        <value name="2M" caption="2 MHz output clock" value="0x1"/>
        <value name="3M" caption="3 MHz output clock" value="0x2"/>
        <value name="4M" caption="4 MHz output clock" value="0x3"/>
        <value name="8M" caption="8 MHz output clock" value="0x5"/>
        <value name="12M" caption="12 MHz output clock" value="0x6"/>
        <value name="16M" caption="16 MHz output clock" value="0x7"/>
        <value name="20M" caption="20 MHz output clock" value="0x8"/>
        <value name="24M" caption="24 MHz output clock" value="0x9"/>
      </value-group>
      <value-group name="OSCCTRL_WPCTRL__WPKEY">
        <value name="KEY" caption="Allow writes to the WPCTRL register" value="0x4F5343"/>
      </value-group>
    </module>
    <module name="PAC" id="U2120" name2="U2120" version="v1" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Write Control">
          <bitfield name="PERID" caption="Peripheral Identifier" mask="0xFFFF" values="PAC_WRCTRL__PERID"/>
          <bitfield name="KEY" caption="Peripheral Access Control Key" mask="0xFF0000" values="PAC_WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="ERREO" caption="Peripheral Access Error Event Output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="ERR" caption="Peripheral Access Error Interrupt Disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="ERR" caption="Peripheral Access Error Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGAHB" initval="0x00000000" caption="AHB Client Bus Interrupt Flag Status and Clear">
          <bitfield name="FLASH_" caption="FLASH" mask="0x1"/>
          <bitfield name="HSRAMCM0P_" caption="HSRAMCM0P" mask="0x2"/>
          <bitfield name="HSRAMDSU_" caption="HSRAMDSU" mask="0x4"/>
          <bitfield name="APBB_" caption="APBB" mask="0x8"/>
          <bitfield name="APBA_" caption="APBA" mask="0x10"/>
          <bitfield name="APBC_" caption="APBC" mask="0x20"/>
          <bitfield name="SRAMDMAC_" caption="SRAMDMAC" mask="0x40"/>
          <bitfield name="BROM_" caption="BROM" mask="0x80"/>
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral Interrupt Flag Status and Clear A">
          <bitfield name="PAC_" caption="PAC" mask="0x1"/>
          <bitfield name="PM_" caption="PM" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC" mask="0x400"/>
        </register>
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral Interrupt Flag Status and Clear B">
          <bitfield name="PORT_" caption="PORT" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC" mask="0x8"/>
          <bitfield name="MTB_" caption="MTB" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS" mask="0x20"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral Interrupt Flag Status and Clear C">
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x4"/>
          <bitfield name="TC0_" caption="TC0" mask="0x8"/>
          <bitfield name="TC1_" caption="TC1" mask="0x10"/>
          <bitfield name="TC2_" caption="TC2" mask="0x20"/>
          <bitfield name="TCC0_" caption="TCC0" mask="0x40"/>
          <bitfield name="ADC0_" caption="ADC0" mask="0x80"/>
          <bitfield name="AC_" caption="AC" mask="0x100"/>
          <bitfield name="CCL_" caption="CCL" mask="0x200"/>
          <bitfield name="PTC_" caption="PTC" mask="0x400"/>
          <bitfield name="SYSCTRL_" caption="SYSCTRL" mask="0x800"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00000000" caption="Peripheral Write Protection Status A">
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Protect Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Protect Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Protect Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Protect Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Protect Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Protect Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Protect Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Protect Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Protect Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x400"/>
        </register>
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Peripheral Write Protection Status B">
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Protect Enable" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x8"/>
          <bitfield name="MTB_" caption="MTB APB Protect Enable" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Protect Enable" mask="0x20"/>
        </register>
