zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10032.atdf
      <value-group name="PORT_EVCTRL__EVACTx">
        <value name="OUT" caption="The output value of pin PIDn will be set to the level of the event" value="0x00"/>
        <value name="SET" caption="Set the output value of pin PIDn on the rising edge of the event" value="0x01"/>
        <value name="CLR" caption="Clear the output value of pin PIDn on the rising edge of the event" value="0x02"/>
        <value name="TGL" caption="Toggle the output value of pin PIDn on the rising edge of the event" value="0x03"/>
      </value-group>
      <value-group name="PORT_PMUX__PMUXE">
        <value name="A" caption="Peripheral function A selected" value="0x00"/>
        <value name="B" caption="Peripheral function B selected" value="0x01"/>
        <value name="C" caption="Peripheral function C selected" value="0x02"/>
        <value name="D" caption="Peripheral function D selected" value="0x03"/>
        <value name="E" caption="Peripheral function E selected" value="0x04"/>
        <value name="F" caption="Peripheral function F selected" value="0x05"/>
        <value name="G" caption="Peripheral function G selected" value="0x06"/>
        <value name="H" caption="Peripheral function H selected" value="0x07"/>
        <value name="I" caption="Peripheral function I selected" value="0x08"/>
        <value name="J" caption="Peripheral function J selected" value="0x09"/>
      </value-group>
      <value-group name="PORT_PMUX__PMUXO">
        <value name="A" caption="Peripheral function A selected" value="0x00"/>
        <value name="B" caption="Peripheral function B selected" value="0x01"/>
        <value name="C" caption="Peripheral function C selected" value="0x02"/>
        <value name="D" caption="Peripheral function D selected" value="0x03"/>
        <value name="E" caption="Peripheral function E selected" value="0x04"/>
        <value name="F" caption="Peripheral function F selected" value="0x05"/>
        <value name="G" caption="Peripheral function G selected" value="0x06"/>
        <value name="H" caption="Peripheral function H selected" value="0x07"/>
        <value name="I" caption="Peripheral function I selected" value="0x08"/>
        <value name="J" caption="Peripheral function J selected" value="0x09"/>
      </value-group>
    </module>
    <module name="PTC" id="06273" name2="afe_ptc_ctrl_arm_v1" version="1.a.0" caption="Peripheral Touch Controller"/>
    <module name="RSTC" id="06259" name2="rst_ctrl_arm_v1" version="v1" caption="Reset Controller">
      <register-group name="RSTC" caption="Reset Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="RSTPINDIS" caption="Reset Pin Disable" mask="0x100"/>
        </register>
        <register name="RCAUSE" offset="0x4" rw="R" size="4" caption="Reset Cause">
          <bitfield name="POR" caption="Power-On Reset Flag" mask="0x1"/>
          <bitfield name="BORVDD" caption="VDD Brownout Reset Flag" mask="0x2"/>
          <bitfield name="EXT" caption="External Reset Flag" mask="0x8"/>
          <bitfield name="WDT" caption="Watchdog Reset Flag" mask="0x10"/>
          <bitfield name="SYST" caption="System Reset Flag" mask="0x20"/>
          <bitfield name="LOCKUP" caption="Software Reset Flag" mask="0x40"/>
        </register>
        <register name="DBGCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Debug Control">
          <bitfield name="LCKUPDIS" caption="Lockup Disable" mask="0x1"/>
        </register>
        <register name="WPCTRL" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Write Protection Control">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPLCK" caption="Write Protection Lock" mask="0x2"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="RSTC_WPCTRL__WPKEY"/>
        </register>
      </register-group>
      <value-group name="RSTC_WPCTRL__WPKEY">
        <value name="KEY" caption="Allow writes to the WPCTRL register" value="0x525354"/>
      </value-group>
    </module>
    <module name="RTC" id="U2250" name2="U2250" version="v1" caption="Real-Time Counter">
      <register-group name="RTC" caption="Real-Time Counter">
        <mode name="MODE0" qualifier="RTC.MODE0.CTRLA.MODE" value="0" caption="32-bit Counter Mode"/>
        <mode name="MODE1" qualifier="RTC.MODE1.CTRLA.MODE" value="1" caption="16-bit Counter Mode"/>
        <mode name="MODE2" qualifier="RTC.MODE2.CTRLA.MODE" value="2" caption="Clock and Calendar Mode with Alarm"/>
        <register modes="MODE0" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE0 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="RTC_MODE0_CTRLA__MODE"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE0_CTRLA__PRESCALER"/>
          <bitfield name="COUNTSYNC" caption="COUNT Read Resynchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE1 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="RTC_MODE1_CTRLA__MODE"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE1_CTRLA__PRESCALER"/>
          <bitfield name="COUNTSYNC" caption="COUNT Read Resynchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE2 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="RTC_MODE2_CTRLA__MODE"/>
          <bitfield name="CLKREP" caption="Clock Representation" mask="0x40" values="RTC_MODE2_CTRLA__CLKREP"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE2_CTRLA__PRESCALER"/>
          <bitfield name="CLOCKSYNC" caption="CLOCK Read Resynchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE0" name="EVCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="MODE0 Event Control">
          <bitfield name="PEREO0" caption="Periodic Interval 0 Event Output Enable" mask="0x1"/>
          <bitfield name="PEREO1" caption="Periodic Interval 1 Event Output Enable" mask="0x2"/>
          <bitfield name="PEREO2" caption="Periodic Interval 2 Event Output Enable" mask="0x4"/>
          <bitfield name="PEREO3" caption="Periodic Interval 3 Event Output Enable" mask="0x8"/>
          <bitfield name="PEREO4" caption="Periodic Interval 4 Event Output Enable" mask="0x10"/>
          <bitfield name="PEREO5" caption="Periodic Interval 5 Event Output Enable" mask="0x20"/>
          <bitfield name="PEREO6" caption="Periodic Interval 6 Event Output Enable" mask="0x40"/>
          <bitfield name="PEREO7" caption="Periodic Interval 7 Event Output Enable" mask="0x80"/>
          <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
          <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="EVCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="MODE1 Event Control">
          <bitfield name="PEREO0" caption="Periodic Interval 0 Event Output Enable" mask="0x1"/>
          <bitfield name="PEREO1" caption="Periodic Interval 1 Event Output Enable" mask="0x2"/>
          <bitfield name="PEREO2" caption="Periodic Interval 2 Event Output Enable" mask="0x4"/>
          <bitfield name="PEREO3" caption="Periodic Interval 3 Event Output Enable" mask="0x8"/>
          <bitfield name="PEREO4" caption="Periodic Interval 4 Event Output Enable" mask="0x10"/>
          <bitfield name="PEREO5" caption="Periodic Interval 5 Event Output Enable" mask="0x20"/>
          <bitfield name="PEREO6" caption="Periodic Interval 6 Event Output Enable" mask="0x40"/>
          <bitfield name="PEREO7" caption="Periodic Interval 7 Event Output Enable" mask="0x80"/>
          <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
          <bitfield name="CMPEO1" caption="Compare 1 Event Output Enable" mask="0x200"/>
          <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
        </register>
