zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10032.atdf
      <value-group name="SUPC_BODVDD__STDBYCFG">
        <value name="CONT" caption="Continuous Mode" value="0x0"/>
        <value name="SAMP" caption="Sampling Mode" value="0x1"/>
      </value-group>
      <value-group name="SUPC_BODVDD__ACTCFG">
        <value name="CONT" caption="Continuous Mode" value="0x0"/>
        <value name="SAMP" caption="Sampling Mode" value="0x1"/>
      </value-group>
      <value-group name="SUPC_BODVDD__SAMPFREQ">
        <value name="128HZ" caption="128 Hz Sampling Frequency" value="0x0"/>
        <value name="32HZ" caption="32 Hz Sampling Frequency" value="0x1"/>
      </value-group>
      <value-group name="SUPC_BODVDD__LEVEL">
        <value name="BODLEVEL0" caption="1.90V" value="0x0"/>
        <value name="BODLEVEL1" caption="2.45V" value="0x1"/>
        <value name="BODLEVEL2" caption="2.70V" value="0x2"/>
        <value name="BODLEVEL3" caption="2.85V" value="0x3"/>
      </value-group>
      <value-group name="SUPC_BODVDD__VLMLVL">
        <value name="OFF" caption="VLM is disabled" value="0x0"/>
        <value name="5ABOVE" caption="The VLM threshold is 5% above the BOD threshold" value="0x1"/>
        <value name="15ABOVE" caption="The VLM threshold is 15% above the BOD threshold" value="0x2"/>
        <value name="25ABOVE" caption="The VLM threshold is 25% above the BOD threshold" value="0x3"/>
      </value-group>
      <value-group name="SUPC_BODVDD__VLMCFG">
        <value name="FALLING" caption="VDD falls below the VLM threshold" value="0x0"/>
        <value name="RISING" caption="VDD rises above the VLM threshold" value="0x1"/>
        <value name="BOTH" caption="VDD crosses the VLM threshold" value="0x2"/>
      </value-group>
      <value-group name="SUPC_MVIO__MODE">
        <value name="DUAL" caption="MVIO operating in dual supply mode" value="0x0"/>
        <value name="SINGLE" caption="MVIO operating in Single supply mode" value="0x1"/>
      </value-group>
      <value-group name="SUPC_MVIO__VDDIO2CFG">
        <value name="NORMAL" caption="VDDIO2 with voltage protection enabled" value="0x0"/>
        <value name="LOWPOWER" caption="VDDIO2 with voltage protection disabled" value="0x1"/>
        <value name="VDDIO2OFF" caption="VDDIO2 domain is disabled. I/O pins are not available." value="0x2"/>
      </value-group>
      <value-group name="SUPC_WPCTRL__WPKEY">
        <value name="KEY" caption="Allows writes to the WPCTRL register" value="0x535550"/>
      </value-group>
    </module>
    <module name="SYSCTRL" id="06261" name2="cfg_sysctrl_arm_v1" version="v1-rc12" caption="System Controller">
      <register-group name="SYSCTRL" caption="System Controller">
        <register name="BOOTCTRL" offset="0x80" rw="RW" size="4" initval="0x00000000" caption="Boot Control">
          <bitfield name="SYSINIT" caption="System Initialization Ongoing" mask="0x1"/>
          <bitfield name="BREXTEN" caption="BREXT Enable" mask="0x2"/>
          <bitfield name="FORCEPARK" caption="Force Park Mode Entry" mask="0x4"/>
        </register>
        <register name="USERCFG" offset="0x84" rw="RW" size="4" initval="0x00000000" caption="User Configuration">
          <bitfield name="CRCSEL" caption="CRC Polynomial Selection" mask="0x40" values="SYSCTRL_USERCFG__CRCSEL"/>
          <bitfield name="CRCBOOT" caption="CRC Boot" mask="0x80"/>
          <bitfield name="SUT" caption="Start-up Time" mask="0x700" values="SYSCTRL_USERCFG__SUT"/>
        </register>
        <register name="TEMPSENSE" offset="0x88" rw="R" size="4" caption="Temperature Sensor Calibration">
          <bitfield name="TEMPSENSE0" caption="Temperature Sensor Calibration Slope" mask="0xFFFF"/>
          <bitfield name="TEMPSENSE1" caption="Temperature Sensor Calibration Offset" mask="0xFFFF0000"/>
        </register>
      </register-group>
      <value-group name="SYSCTRL_USERCFG__CRCSEL">
        <value name="CRC16" caption="CRC-16-CCITT" value="0x0"/>
        <value name="CRC32" caption="CRC-32 (IEEE 802.3)" value="0x1"/>
      </value-group>
      <value-group name="SYSCTRL_USERCFG__SUT">
        <value name="0MS" caption="0 ms" value="0x0"/>
        <value name="1MS" caption="1 ms" value="0x1"/>
        <value name="2MS" caption="2 ms" value="0x2"/>
        <value name="4MS" caption="4 ms" value="0x3"/>
        <value name="8MS" caption="8 ms" value="0x4"/>
        <value name="16MS" caption="16 ms" value="0x5"/>
        <value name="32MS" caption="32 ms" value="0x6"/>
        <value name="64MS" caption="64 ms" value="0x7"/>
      </value-group>
    </module>
    <module name="SysTick" id="SYSTEM_IP" version="1.0.0" caption="System timer">
      <register-group name="SysTick" caption="System timer">
        <register name="CSR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000004" caption="SysTick Control and Status Register">
          <bitfield name="ENABLE" caption="SysTick Counter Enable" mask="0x1" values="SysTick_CSR__ENABLE"/>
          <bitfield name="TICKINT" caption="SysTick Exception Request Enable" mask="0x2" values="SysTick_CSR__TICKINT"/>
          <bitfield name="CLKSOURCE" caption="Clock Source 0=external, 1=processor" mask="0x4" values="SysTick_CSR__CLKSOURCE"/>
          <bitfield name="COUNTFLAG" caption="Timer counted to 0 since last read of register" mask="0x10000"/>
        </register>
        <register name="RVR" offset="0x4" rw="RW" size="4" access-size="4" caption="SysTick Reload Value Register">
          <bitfield name="RELOAD" caption="Value to load into the SysTick Current Value Register when the counter reaches 0" mask="0xFFFFFF"/>
        </register>
        <register name="CVR" offset="0x8" rw="RW" size="4" access-size="4" caption="SysTick Current Value Register">
          <bitfield name="CURRENT" caption="Current value at the time the register is accessed" mask="0xFFFFFF"/>
        </register>
        <register name="CALIB" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="SysTick Calibration Value Register">
          <bitfield name="TENMS" caption="Reload value to use for 10ms timing" mask="0xFFFFFF"/>
          <bitfield name="SKEW" caption="TENMS is rounded from non-integer ratio" mask="0x40000000" values="SysTick_CALIB__SKEW"/>
          <bitfield name="NOREF" caption="No Separate Reference Clock" mask="0x80000000" values="SysTick_CALIB__NOREF"/>
        </register>
      </register-group>
