zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10032.atdf
        <register modes="COUNT16" name="CCBUF" offset="0x30" rw="RW" access="WSYNC" size="2" count="2" initval="0x0000" caption="COUNT16 Channel # Compare Buffer">
          <bitfield name="CCBUF" caption="Channel Compare Buffer Value" mask="0xFFFF"/>
        </register>
        <register modes="COUNT32" name="CCBUF" offset="0x30" rw="RW" access="WSYNC" size="4" count="2" initval="0x00000000" caption="COUNT32 Channel # Compare Buffer">
          <bitfield name="CCBUF" caption="Channel Compare Buffer Value" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="TC_CTRLA__MODE">
        <value name="COUNT16" caption="Counter in 16-bit mode" value="0x0"/>
        <value name="COUNT8" caption="Counter in 8-bit mode" value="0x1"/>
        <value name="COUNT32" caption="Counter in 32-bit mode" value="0x2"/>
      </value-group>
      <value-group name="TC_CTRLA__PRESCSYNC">
        <value name="GCLK" caption="Reload or reset the counter on next generic clock" value="0x0"/>
        <value name="PRESC" caption="Reload or reset the counter on next prescaler clock" value="0x1"/>
        <value name="RESYNC" caption="Reload or reset the counter on next generic clock. Reset the prescaler counter." value="0x2"/>
      </value-group>
      <value-group name="TC_CTRLA__PRESCALER">
        <value name="DIV1" caption="Prescaler: GCLK_TC" value="0x0"/>
        <value name="DIV2" caption="Prescaler: GCLK_TC/2" value="0x1"/>
        <value name="DIV4" caption="Prescaler: GCLK_TC/4" value="0x2"/>
        <value name="DIV8" caption="Prescaler: GCLK_TC/8" value="0x3"/>
        <value name="DIV16" caption="Prescaler: GCLK_TC/16" value="0x4"/>
        <value name="DIV64" caption="Prescaler: GCLK_TC/64" value="0x5"/>
        <value name="DIV256" caption="Prescaler: GCLK_TC/256" value="0x6"/>
        <value name="DIV1024" caption="Prescaler: GCLK_TC/1024" value="0x7"/>
      </value-group>
      <value-group name="TC_CTRLA__CAPTMODE0">
        <value name="DEFAULT" caption="Default capture" value="0x0"/>
        <value name="CAPTMIN" caption="Minimum capture" value="0x1"/>
        <value name="CAPTMAX" caption="Maximum capture" value="0x2"/>
      </value-group>
      <value-group name="TC_CTRLA__CAPTMODE1">
        <value name="DEFAULT" caption="Default capture" value="0x0"/>
        <value name="CAPTMIN" caption="Minimum capture" value="0x1"/>
        <value name="CAPTMAX" caption="Maximum capture" value="0x2"/>
      </value-group>
      <value-group name="TC_CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RETRIGGER" caption="Force a start, restart or retrigger" value="0x1"/>
        <value name="STOP" caption="Force a stop" value="0x2"/>
        <value name="UPDATE" caption="Force update of double buffered registers" value="0x3"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="0x4"/>
        <value name="DMAOS" caption="One-shot DMA trigger" value="0x5"/>
      </value-group>
      <value-group name="TC_EVCTRL__EVACT">
        <value name="OFF" caption="Event action disabled" value="0x0"/>
        <value name="RETRIGGER" caption="Start, restart or retrigger TC on event" value="0x1"/>
        <value name="COUNT" caption="Count on event" value="0x2"/>
        <value name="START" caption="Start TC on event" value="0x3"/>
        <value name="STAMP" caption="Time stamp capture" value="0x4"/>
        <value name="PPW" caption="Period captured in CC0, pulse width in CC1" value="0x5"/>
        <value name="PWP" caption="Period captured in CC1, pulse width in CC0" value="0x6"/>
        <value name="PW" caption="Pulse width capture" value="0x7"/>
      </value-group>
      <value-group name="TC_WAVE__WAVEGEN">
        <value name="NFRQ" caption="Normal Frequency Generation mode" value="0x0"/>
        <value name="MFRQ" caption="Match Frequency Generation mode" value="0x1"/>
        <value name="NPWM" caption="Normal Pulse-Width Modulation mode" value="0x2"/>
        <value name="MPWM" caption="Match Pulse-Width Modulation mode" value="0x3"/>
      </value-group>
    </module>
    <module name="TCC" id="03610" name2="tmr_tcc_u2213_v4" version="v1" caption="Timer/Counter for Control Applications">
      <register-group name="TCC" caption="Timer/Counter for Control Applications">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TCC_CTRLA__PRESCALER"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x800"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization" mask="0x3000" values="TCC_CTRLA__PRESCSYNC"/>
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x4000"/>
          <bitfield name="FCYCLE" caption="Full Cycle Enable" mask="0x10000"/>
          <bitfield name="DMAOS" caption="DMA One-Shot Trigger Mode" mask="0x800000"/>
          <bitfield name="CPTEN0" caption="Capture Channel 0 Enable" mask="0x1000000"/>
          <bitfield name="CPTEN1" caption="Capture Channel 1 Enable" mask="0x2000000"/>
          <bitfield name="CPTEN2" caption="Capture Channel 2 Enable" mask="0x4000000"/>
          <bitfield name="CPTEN3" caption="Capture Channel 3 Enable" mask="0x8000000"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
          <bitfield name="IDXCMD" caption="Ramp Index Command" mask="0x18"/>
          <bitfield name="CMD" caption="TCC Command" mask="0xE0"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
          <bitfield name="IDXCMD" caption="Ramp Index Command" mask="0x18" values="TCC_CTRLBSET__IDXCMD"/>
          <bitfield name="CMD" caption="TCC Command" mask="0xE0" values="TCC_CTRLBSET__CMD"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="SWRST Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="ENABLE Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
          <bitfield name="STATUS" caption="STATUS Synchronization Busy" mask="0x8"/>
          <bitfield name="COUNT" caption="COUNT Synchronization Busy" mask="0x10"/>
          <bitfield name="PATT" caption="PATT Synchronization Busy" mask="0x20"/>
          <bitfield name="WAVE" caption="WAVE Synchronization Busy" mask="0x40"/>
          <bitfield name="PER" caption="PER Synchronization Busy" mask="0x80"/>
          <bitfield name="CC0" caption="Compare/Capture Channel 0 Synchronization Busy" mask="0x100"/>
          <bitfield name="CC1" caption="Compare/Capture Channel 1 Synchronization Busy" mask="0x200"/>
          <bitfield name="CC2" caption="Compare/Capture Channel 2 Synchronization Busy" mask="0x400"/>
          <bitfield name="CC3" caption="Compare/Capture Channel 3 Synchronization Busy" mask="0x800"/>
        </register>
        <register name="FCTRLA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Recoverable Fault Control #">
          <bitfield name="SRC" caption="Recoverable Fault Source" mask="0x3" values="TCC_FCTRLA__SRC"/>
          <bitfield name="KEEP" caption="Recoverable Fault Keep" mask="0x8"/>
          <bitfield name="QUAL" caption="Recoverable Fault Qualification" mask="0x10"/>
          <bitfield name="BLANK" caption="Recoverable Fault Blanking Operation" mask="0x60" values="TCC_FCTRLA__BLANK"/>
          <bitfield name="RESTART" caption="Recoverable Fault Restart" mask="0x80"/>
          <bitfield name="HALT" caption="Recoverable Fault Halt Operation" mask="0x300" values="TCC_FCTRLA__HALT"/>
          <bitfield name="CHSEL" caption="Recoverable Fault Capture Channel" mask="0xC00" values="TCC_FCTRLA__CHSEL"/>
          <bitfield name="CAPTURE" caption="Recoverable Fault Capture Action" mask="0x7000" values="TCC_FCTRLA__CAPTURE"/>
          <bitfield name="BLANKPRESC" caption="Recoverable Fault Blanking Value Prescaler" mask="0x8000"/>
          <bitfield name="BLANKVAL" caption="Recoverable Fault Blanking Value" mask="0xFF0000"/>
          <bitfield name="FILTERVAL" caption="Recoverable Fault Filter Value" mask="0xF000000"/>
        </register>
        <register name="FCTRLB" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Recoverable Fault Control #">
          <bitfield name="SRC" caption="Recoverable Fault Source" mask="0x3" values="TCC_FCTRLB__SRC"/>
          <bitfield name="KEEP" caption="Recoverable Fault Keep" mask="0x8"/>
          <bitfield name="QUAL" caption="Recoverable Fault Qualification" mask="0x10"/>
          <bitfield name="BLANK" caption="Recoverable Fault Blanking Operation" mask="0x60" values="TCC_FCTRLB__BLANK"/>
          <bitfield name="RESTART" caption="Recoverable Fault Restart" mask="0x80"/>
          <bitfield name="HALT" caption="Recoverable Fault Halt Operation" mask="0x300" values="TCC_FCTRLB__HALT"/>
          <bitfield name="CHSEL" caption="Recoverable Fault Capture Channel" mask="0xC00" values="TCC_FCTRLB__CHSEL"/>
          <bitfield name="CAPTURE" caption="Recoverable Fault Capture Action" mask="0x7000" values="TCC_FCTRLB__CAPTURE"/>
          <bitfield name="BLANKPRESC" caption="Recoverable Fault Blanking Value Prescaler" mask="0x8000"/>
          <bitfield name="BLANKVAL" caption="Recoverable Fault Blanking Value" mask="0xFF0000"/>
          <bitfield name="FILTERVAL" caption="Recoverable Fault Filter Value" mask="0xF000000"/>
        </register>
        <register name="WEXCTRL" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Waveform Extension Control">
          <bitfield name="OTMX" caption="Output Matrix" mask="0x3"/>
        </register>
        <register name="DRVCTRL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Driver Control">
          <bitfield name="NRE0" caption="Non-Recoverable State 0 Output Enable" mask="0x1"/>
          <bitfield name="NRE1" caption="Non-Recoverable State 1 Output Enable" mask="0x2"/>
          <bitfield name="NRE2" caption="Non-Recoverable State 2 Output Enable" mask="0x4"/>
          <bitfield name="NRE3" caption="Non-Recoverable State 3 Output Enable" mask="0x8"/>
          <bitfield name="NRV0" caption="Non-Recoverable State 0 Output Value" mask="0x100"/>
          <bitfield name="NRV1" caption="Non-Recoverable State 1 Output Value" mask="0x200"/>
          <bitfield name="NRV2" caption="Non-Recoverable State 2 Output Value" mask="0x400"/>
          <bitfield name="NRV3" caption="Non-Recoverable State 3 Output Value" mask="0x800"/>
          <bitfield name="INVEN0" caption="Waveform Output 0 Inversion" mask="0x10000"/>
          <bitfield name="INVEN1" caption="Waveform Output 1 Inversion" mask="0x20000"/>
          <bitfield name="INVEN2" caption="Waveform Output 2 Inversion" mask="0x40000"/>
          <bitfield name="INVEN3" caption="Waveform Output 3 Inversion" mask="0x80000"/>
          <bitfield name="FILTERVAL0" caption="Non-Recoverable Fault Input 0 Filter Value" mask="0xF000000"/>
          <bitfield name="FILTERVAL1" caption="Non-Recoverable Fault Input 1 Filter Value" mask="0xF0000000"/>
        </register>
        <register name="DBGCTRL" offset="0x1E" rw="RW" size="1" initval="0x00" caption="Debug control">
          <bitfield name="DBGRUN" caption="Debug Running State" mask="0x1"/>
          <bitfield name="FDDBD" caption="Fault Detection on Debug Break Detection" mask="0x4"/>
        </register>
