zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10032.atdf
      <value-group name="WDT_CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_CLEAR__CLEAR">
        <value name="KEY" caption="In Normal mode, writing during the WDT time-out period will clear the WDT and restart the WDT time-out period.(1) In Window mode, writing during the open window will clear the WDT and restart the WDT time-out sequence.(2)" value="0xA5"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="QUAD32MVIO" caption="QUAD32MVIO">
      <pin position="1" pad="PA03"/>
      <pin position="2" pad="PA04"/>
      <pin position="3" pad="PA05"/>
      <pin position="4" pad="PA06"/>
      <pin position="5" pad="PA07"/>
      <pin position="6" pad="PA08"/>
      <pin position="7" pad="PA09"/>
      <pin position="8" pad="PA10"/>
      <pin position="9" pad="PA11"/>
      <pin position="10" pad="VDDIO2PAD"/>
      <pin position="11" pad="PA17"/>
      <pin position="12" pad="PA18"/>
      <pin position="13" pad="PA19"/>
      <pin position="14" pad="PA20"/>
      <pin position="15" pad="PA21"/>
      <pin position="16" pad="PA22"/>
      <pin position="17" pad="PA23"/>
      <pin position="18" pad="VDDDBL"/>
      <pin position="19" pad="GNDDBL"/>
      <pin position="20" pad="PA24"/>
      <pin position="21" pad="PA25"/>
      <pin position="22" pad="PA26"/>
      <pin position="23" pad="PA27"/>
      <pin position="24" pad="PA28"/>
      <pin position="25" pad="PA29"/>
      <pin position="26" pad="PA30"/>
      <pin position="27" pad="PA31"/>
      <pin position="28" pad="VDDPAD"/>
      <pin position="29" pad="GNDPAD"/>
      <pin position="30" pad="PA00"/>
      <pin position="31" pad="PA01"/>
      <pin position="32" pad="PA02"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
